# Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
# Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один
# одному. Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого
# автомобілями; загальний шлях = час · сумарна швидкість.
v1 = int(input("1 speed = "))
v2 = int(input("2 speed = "))
s = int(input("distance = "))
t = int(input("time = "))


def new_distance():
   s2 = abs(s - t*(v1+v2))
   print(s2)


new_distance()
